# coding: utf-8
class RomanConverter
  PATS = {
      # 特殊表記（固有名詞） かなの長さ順に並べる
      'インマヌエル' => 'EMMANUEL',
      'ハレルーヤー' => 'HALLELUJAH',

      'クリスマス' => 'CHRISTMAS',
      'グローリー' => 'GLORY',
      'リバイバル' => 'REVIVAL',
      'ファミリー' => 'FAMILY',

      'アーメン' => 'AMEN',
      'アルファ' => 'ALPHA',
      'グローリ' => 'GLORY',
      'ジーザス' => 'JESUS',
      'しょうり' => 'SHORI',
      'ハレルヤ' => 'HALLELUJAH',
      'メサイヤ' => 'MESSIAH',
      'キリスト' => 'KIRISUTO',

      'メシヤ' => 'MESSIAH',
      'オメガ' => 'OMEGA',
      'ホサナ' => 'HOSANNA',
      'ホザナ' => 'HOSANNA',
      'ロード' => 'LORD',
      'イエス' => 'IESU',

      # 促音の特例：っち、っちゃ、っちゅ、っちょ
      'っちゃ' => 'TCHA', 'っちゅ' => 'TCHU', 'っちょ' => 'TCHO', 'っち' => 'TCHI',
      'ッチャ' => 'TCHA', 'ッチュ' => 'TCHU', 'ッチョ' => 'TCHO', 'ッチ' => 'TCHI',

      # 拗音のうしろの「あ」「う」は消える
      # 例：しょうり → ○SHORI ×SHOURI
      '([きしちにひみりぎじぢ]ゃ)あ' => '$1',
      '([きしちにひみりぎじぢ][ゅょ])う' => '$1',

      '([キシチニヒミリギジヂ]ャ)ア' => '$1',
      '([キシチニヒミリギジヂ][ュョ])ウ' => '$1',

      # 拗音
      'きゃ' => 'KYA', 'きゅ' => 'KYU', 'きょ' => 'KYO',
      'しゃ' => 'SHA', 'しゅ' => 'SHU', 'しょ' => 'SHO',
      'ちゃ' => 'CHA', 'ちゅ' => 'CHU', 'ちょ' => 'CHO',
      'にゃ' => 'NYA', 'にゅ' => 'NYU', 'にょ' => 'NYO',
      'ひゃ' => 'HYA', 'ひゅ' => 'HYU', 'ひょ' => 'HYO',
      'みゃ' => 'MYA', 'みゅ' => 'MYU', 'みょ' => 'MYO',
      'りゃ' => 'RYA', 'りゅ' => 'RYU', 'りょ' => 'RYO',
      'ぎゃ' => 'GYA', 'ぎゅ' => 'GYU', 'ぎょ' => 'GYO',
      'じゃ' => 'JYA', 'じゅ' => 'JYU', 'じょ' => 'JYO',
      'キャ' => 'KYA', 'キュ' => 'KYU', 'キョ' => 'KYO',
      'シャ' => 'SHA', 'シュ' => 'SHU', 'シュ' => 'SHU', 'ショ' => 'SHO',
      'チャ' => 'CHA', 'チュ' => 'CHU', 'チョ' => 'CHO',
      'ニャ' => 'NYA', 'ニュ' => 'NYU', 'ニョ' => 'NYO',
      'ヒャ' => 'HYA', 'ヒュ' => 'HYU', 'ヒョ' => 'HYO',
      'ミャ' => 'MYA', 'ミュ' => 'MYU', 'ミョ' => 'MYO',
      'リャ' => 'RYA', 'リュ' => 'RYU', 'リョ' => 'RYO',
      'ギャ' => 'GYA', 'ギュ' => 'GYU', 'ギョ' => 'GYO', 'ジャ' => 'JYA', 'ジュ' => 'JYU', 'ジョ' => 'JYO',

      #「おう」はHで伸ばす
      # 例：「王」→「おう」→「OH」
      'おう' => 'OH',

      # それ以外の「おの段＋う」は「う」を無視する
      # 例：「栄光」→「えいこう」→「EIKO」
      '([こそとのほもよろを])う' => '$1',

      # アの段、オの段の長音はHで伸ばす
      # 例：'サー' → 'サH' → 'SAH'
      #     'コー' → 'コH' → 'KOH'
      '([アカサタナハマヤラワ])ー' => [nil, 'H'],
      '([ガザダバ])ー' => [nil,'H'],

      '([オコソトノホモヨロヲ])ー' => [nil,'H'],
      '([ゴゾドボ])ー' => [nil,'H'],

      # それ以外の長音は無視する
      '(.)ー' => '$1',

      #「ん」の直後の母音はハイフンで分ける
      'んあ' => 'N-A', 'んい' => 'N-I', 'んう' => 'N-U', 'んえ' => 'N-E', 'んお' => 'N-O',
      'ンア' => 'N-A', 'ンイ' => 'N-I', 'ンウ' => 'N-U', 'ンエ' => 'N-E', 'ンオ' => 'N-O',

      # 通常のかな
      'あ' => 'A', 'い' => 'I', 'う' => 'U', 'え' => 'E', 'お' => 'O',
      'か' => 'KA', 'き' => 'KI', 'く' => 'KU', 'け' => 'KE', 'こ' => 'KO',
      'が' => 'GA', 'ぎ' => 'GI', 'ぐ' => 'GU', 'げ' => 'GE', 'ご' => 'GO',
      'さ' => 'SA', 'し' => 'SHI', 'す' => 'SU', 'せ' => 'SE', 'そ' => 'SO',
      'ざ' => 'ZA', 'じ' => 'JI', 'ず' => 'ZU', 'ぜ' => 'ZE', 'ぞ' => 'ZO',
      'た' => 'TA', 'ち' => 'CHI', 'つ' => 'TSU', 'て' => 'TE', 'と' => 'TO',
      'だ' => 'DA', 'ぢ' => 'JI', 'づ' => 'ZU', 'で' => 'DE', 'ど' => 'DO',
      'な' => 'NA', 'に' => 'NI', 'ぬ' => 'NU', 'ね' => 'NE', 'の' => 'NO',
      'は' => 'HA', 'ひ' => 'HI', 'ふ' => 'FU', 'へ' => 'HE', 'ほ' => 'HO',
      'ば' => 'BA', 'び' => 'BI', 'ぶ' => 'BU', 'べ' => 'BE', 'ぼ' => 'BO',
      'ぱ' => 'PA', 'ぴ' => 'PI', 'ぷ' => 'PU', 'ぺ' => 'PE', 'ぽ' => 'PO',
      'ま' => 'MA', 'み' => 'MI', 'む' => 'MU', 'め' => 'ME', 'も' => 'MO',
      'や' => 'YA', 'ゆ' => 'YU', 'よ' => 'YO',
      'ら' => 'RA', 'り' => 'RI', 'る' => 'RU', 'れ' => 'RE', 'ろ' => 'RO',
      'わ' => 'WA', 'を' => 'O',

      'ア' => 'A', 'イ' => 'I', 'ウ' => 'U', 'エ' => 'E', 'オ' => 'O',
      'カ' => 'KA', 'キ' => 'KI', 'ク' => 'KU', 'ケ' => 'KE', 'コ' => 'KO',
      'ガ' => 'GA', 'ギ' => 'GI', 'グ' => 'GU', 'ゲ' => 'GE', 'ゴ' => 'GO',
      'サ' => 'SA', 'シ' => 'SHI', 'ス' => 'SU', 'セ' => 'SE', 'ソ' => 'SO',
      'ザ' => 'ZA', 'ジ' => 'JI', 'ズ' => 'ZU', 'ゼ' => 'ZE', 'ゾ' => 'ZO',
      'タ' => 'TA', 'チ' => 'CHI', 'ツ' => 'TSU', 'テ' => 'TE', 'ト' => 'TO',
      'ダ' => 'DA', 'ヂ' => 'JI', 'ヅ' => 'ZU', 'デ' => 'DE', 'ド' => 'DO',
      'ナ' => 'NA', 'ニ' => 'NI', 'ヌ' => 'NU', 'ネ' => 'NE', 'ノ' => 'NO',
      'ハ' => 'HA', 'ヒ' => 'HI', 'フ' => 'FU', 'ヘ' => 'HE', 'ホ' => 'HO',
      'バ' => 'BA', 'ビ' => 'BI', 'ブ' => 'BU', 'ベ' => 'BE', 'ボ' => 'BO',
      'パ' => 'PA', 'ピ' => 'PI', 'プ' => 'PU', 'ペ' => 'PE', 'ポ' => 'PO',
      'マ' => 'MA', 'ミ' => 'MI', 'ム' => 'MU', 'メ' => 'ME', 'モ' => 'MO',
      'ヤ' => 'YA', 'ユ' => 'YU', 'ヨ' => 'YO',
      'ラ' => 'RA', 'リ' => 'RI', 'ル' => 'RU', 'レ' => 'RE', 'ロ' => 'RO',
      'ワ' => 'WA', 'ヲ' => 'O',

      # 撥音の特例：B,M,Pの前にはNの代わりにMをおく
      # それ以外はNとする
      '[んン]([BMP])' => ['M', nil],
      '[んン]' => 'N',

      # 促音は次の子音を重ねる（特例は定義済み）
      # ※ここまでの変換でその後ろのかなは
      # 　ローマ字に変換されているという前提
      '[っッ](.)' => [nil, nil],

      # 全角スペースを半角スペースに
      '　' => ' '
  }

  def initialize
  end

  def to_roman(kana)
    result = kana.dup
    PATS.each do |kana, replace|
      kana_pat = Regexp.new(kana)
      result.gsub!(kana_pat) do
        case replace
          when '$1'
            $1
          when Array
            replace.map{|s| s.nil? ? $1 : s.to_s }.join('')
          else
            replace
        end
      end
    end
    result.gsub(/[ ]+/, ' ').gsub(/^[ ]+/, '')
  end
end